Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: བཙུན་པ་པད་མའི་མདོག་གིས་ལས་ཅི་ཞིག་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ལ། གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་གྱུར་ཏེ་ པད་མའི་སྙིང་པོའི་མདོག་འདྲ་བར་གྱུར་ལགས།
en: “Lord, what action did Lotus Color take that ripened into his birth into a family of great means, prosperity, and wealth, and that he was well proportioned, pleasing to the eye, and beautiful, with a complexion the color of the center of a lotus?”

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་རི་ཁྲོད་ཅིག་ན་ཀུན་དགའ་ར་བའི་སྲུངས་མ་ཞིག་གནས་པ་དེའི་ཀུན་དགའ་ར་བ་མེ་ཏོག་ཕུན་སུམ་ཚོགས་པ་དང་། འབྲས་བུ་ཕུན་སུམ་ཚོགས་པ་དང་། བསིལ་གྲིབ་ཕུན་སུམ་ཚོགས་པ་དང་། རྫིང་བུ་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་ཏེརྫིང་དེ་དག་ཀྱང་མེ་ཏོག་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོས་གང་བ་དང་ངང་པ་དང་ངུར་པ་དང་ཟལ་མོ་རྣམས་སྐད་འབྱིན་པ་དང་ལྡན་པར་འདུག་གོ། །
en: “Monks, in times past the guardian deity of a pleasure grove was dwelling on a mountainside in her grove of perfect shade. The grove was full of perfect fruits and flowers and all its perfect ponds teemed with blue lotus, lotus, white water lily, white lotus, and the cries of geese, ducks, and other waterfowl.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་མི་བཞུགས་པའི་ཚེ། རང་སངས་རྒྱས་སྡུག་ཅིང་ཕོངས་པ་རྣམས་ལ་སྙིང་བརྩེ་བ། བས་མཐའི་གནས་མལ་གྱིས་འཚོ་བ།
en: In times when a blessed buddha has not arisen in the world, the solitary buddhas appear out of compassion for the destitute and suffering and take up residence in remote places.

source: བསེ་རུ་ལྟ་བུའི་འཇིག་རྟེན་གྱི་ཡོན་གནས་གཅིག་པུ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་སྟེ
en: Solitary as the rhinoceros, they are the only ones in the entire world that are worthy of offerings.

source: རང་སངས་རྒྱས་གཅིག་གིས་ཀུན་དགའ་ར་བ་དེར་གནས་བཅས་སོ། །
en: So it was that a solitary buddha had taken up residence in that pleasure grove.

source: དེ་ནས་ཀུན་དགའ་ར་བའི་སྲུངས་མ་དེ་ནང་པར་སྔར་ལངས་ཏེ་ཀུན་དགའ་ར་བ་དེར་སོང་བ་ལས།
en: “The guardian deity of the pleasure grove rose early one morning and went into the grove.

source: ཀུན་དགའ་ར་བའི་སྲུངས་མ་དེས་རང་སངས་རྒྱས་དེ་ཀླུའི་རྒྱལ་པོ་ལུས་བསྐྱིལ་ཏེ་དེ་གཉིད་ཀྱིས་ལོག་པ་བཞིན་དུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་པ་མཐོང་ངོ་། །
en: She happened upon the solitary buddha sitting beneath a tree as if asleep, legs crossed, his body drawn up like a nāga king, and she was delighted to have found him.

source: མཐོང་ནས་ཀྱང་མཆོག་ཏུ་དགའ་བ་སྐྱེས་སོ། །དགའ་བ་སྐྱེས་ནས་རང་སངས་རྒྱས་དེ་ཀུན་དགའ་ར་བ་དེ་ཉིད་དུ་བཤོས་གསོལ་ནས་ན་བཟའ་ཡང་ཕུལ་ཏེ།
en: Tenderly, she requested that the solitary buddha please take his food in that very pleasure grove and offered him something to eat.

source: མེ་ཏོག་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་རྣམས་ཀྱིས་གཏོར་ནས་
en: “Then she scattered lotus, blue lotus, white water lily, and white lotus over him, and prayed,

source: སྨོན་ལམ་བཏབ་པ། ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་བདག་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་ཤོག་ཅིག །
en: ‘By this root of virtue, wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: བདག་གི་ལུས་མདོག་པད་མའི་སྙིང་པོའི་ཁ་དོག་ལྟ་བུར་གྱུར་ཅིག །
en: May my complexion be the color of the center of a lotus.

source: འདི་བས་ཀྱང་ཁྱད་པར་དུ་འཕགས་པའི་སྟོན་པ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: May I please and not displease a teacher even more exalted than this.

source: ཡོན་ཏན་གྱི་ཚོགས་འདི་ལྟ་བུ་དག་ཀྱང་ཐོབ་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: May I achieve such great virtues.’

source: དེའི་ཚེ་ཀུན་དགའ་ར་བའི་སྲུངས་མར་གྱུར་པ་དེ་ནི་པད་མའི་མདོག་འདི་ཉིད་ཡིན་ཏེ།
en: The one who was the guardian deity of that pleasure grove then is none other than Lotus Color.

source: དེས་རང་སངས་རྒྱས་དེ་ལ་བཀུར་སྟི་བྱས་ནས་སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ནས་
en: The act of venerating that solitary buddha and saying that prayer ripened into his birth into a family of great means, prosperity, and wealth,

source: གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་གྱུར་ཏེ་ལུས་ཀྱི་མདོག་པད་མའི་སྙིང་པོའི་ཁ་དོག་ལྟ་བུར་གྱུར་ཏེ
en: as one who was well proportioned, pleasing to the eye, and beautiful, with a complexion the color of the center of a lotus.

source: དགེ་སློང་དག་རང་སངས་རྒྱས་བྱེ་བ་ཕྲག་འབུམ་བས་ཀྱང་ཆེས་ལྷག་པར་ཁྱད་པར་དུ་འཕགས་པ་ང་ལྟ་བུ་འདིས་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེདགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།། །།
en: Monks, I am more exalted than even one hundred billion solitary buddhas, and now he has pleased and not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.”

source: ཤན་པ་ཞེས་བྱ་བ་ནི།
en: The Butcher

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་ཤན་པ་ཞིག་གནས་པ་དེས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མར་བླངས་པ་ལས།
en: When the Blessed One was in Śrāvastī there lived a certain butcher, and when the time came for him to marry he took a wife.

source: ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས་དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་བྱུང་སྟེཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ནས་
en: One day his wife conceived, and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེ་ཕ་མའི་སྙིང་དུ་ཤས་ཆེར་སྡུག་ཅིང་ཕངས་ལ་ཡིད་དུ་འོང་བར་གྱུར་ཏོ། །
en: His parents loved and cherished him greatly, and held him dear to their hearts.

source: དེ་ནས་དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ཏེ་རིགས་དང་འཐུན་པའི་མིང་བཏགས་ནས།
en: At the elaborate feast celebrating his birth they named him according to their clan.

source: འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ། དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཕ་མ་དེ་གཉིས་ཀྱིས་བཟའ་བ་དང་བཅའ་བ་བཟང་པོ་བྱིན་ལ་ལས་ཅི་ཡང་བྱེད་དུ་མི་འཇུག་གོ། །
en: They raised him on milk, yogurt, butter, ghee, and milk solids, and as he grew up his parents gave him many good, wholesome foods, and prevented him from doing any work.

source: དེ་ནས་ཕྱིས་དེའི་ཕས་དེ་རང་གི་ལས་བྱེད་དུ་བཅུག་པ་དང་དེ་ན་རེ་ཡབ་བདག་ནི་བདག་ཉིད་འགུམ་པའི་རྔོ་ནི་ཐོགས་ཀྱི། སྲོག་ཆགས་འགུམ་པའི་རྔོ་ནི་མི་ཐོགས་སོ་ཞེས་ཟེར་རོ། །
en: One day, as his father started to teach him his trade, the young man exclaimed, “Father, I would rather kill myself than take a life!”

source: ཤན་པའི་ཆུང་མས་སྨྲས་པ།
en: The butcher’s wife said,

source: ཇོ་བོ་ཁྱེའུ་འདི་ལ་གནོད་པར་མ་མཛད་ཅིག་དང་།
en: “Lord, please don’t harm the child!

source: བདག་ཅག་གིས་ལས་འདི་གླ་མི་བགྱིད་དུ་སྩལ་ཏོ། །
en: We can hire help to do this work,”

source: དེ་ནས་དེ་སྐད་ཅེས་ཐོས་པའི་མོད་ལ། ཤན་པ་དེས་ཁྱེའུ་དེ་དལ་བར་བཞག་གོ། །
en: so the butcher let the young man do as he liked.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱེའུ་དེས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས།
en: Soon after that, their son found faith in the doctrine of the Blessed One,

source: དེ་དུས་དུས་སུ་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་འགྲོ་ཞིང་བཅོམ་ལྡན་འདས་ལ་ཆོས་མཉན་པར་བྱེད་དོ། །
en: and from time to time he would go to the garden of Prince Jeta to hear the Dharma from the Blessed One.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་རབ་ཏུ་འབྱུང་བའི་སེམས་སྐྱེས་ནས། དེས་བསམས་པ།
en: One day the idea came to him to go forth, and he thought,

source: བདག་གིས་ཁྱིམ་ན་གནས་པ་བཏང་ལ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་ངོ་སྙམ་ནས།
en: “I will give up living at home to go forth in the doctrine of the Blessed One.”

source: ཕ་མ་གཉིས་ལ་གསོལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་བསྙེན་པར་རྫོགས་པར་བྱས་སོ། །
en: He asked for his parents’ permission, went forth as a novice in the doctrine of the Blessed One, and then received full ordination.

source: དེ་ནས་དེས་བརྩོན་པ་དང་། བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས།
en: Casting away all afflictive emotions through diligence, practice, and effort, he manifested arhatship.

source: གསེར་དང་བོང་བར་མཉམ་པ་ནམ་མཁའ་དང་ལག་མཐིལ་དུ་འདྲ་བའི་སེམས་དང་ལྡན་པ་ཙན་དན་སྦངས་པ་ལྟ་བུར་བསིལ་བར་གྱུར་པ།
en: his mind regarded gold no differently than filth, and the palms of his hands as like space itself. He became cool like wet sandalwood.

source: རིག་པས་སྒོ་ངའི་སྦུབས་བཅོམ་པ་རིག་པ་དང་མངོན་པར་ཤེས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ་སྲིད་པའི་རྙེད་པ་དང་།
en: His insight crushed ignorance like an eggshell. He achieved the insights, superknowledges, and discriminations.

source: ཆགས་པ་དང་བཀུར་སྟི་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་དབང་པོ་དང་ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་ཅིང་རྗེད་པ་དང་གུས་པར་སྨྲ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: He had no regard for worldly profit, passion, or acclaim. He became an object of offering, veneration, and respectful address by Indra, Upendra, and the other gods.

source: དེ་ནས་དེས་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་ནས་བསམས་པ།
en: Then, after achieving arhatship, he wondered,

source: བདག་གིས་འདུལ་བར་འགྱུར་བ་འགའ་ལྟ་ཡོད་དམ་སྙམ་པ་དང་། དེས་ཐོག་མ་ཁོ་ནར་ཕ་མ་གཉིས་འདུལ་བར་འགྱུར་བ་མཐོང་ངོ་། །
en: “Whom might I tame?” He looked out and saw that he could tame his two parents.

source: མཐོང་ནས་ཀྱང་དེ་གཉིས་ཀྱི་ཐད་དུ་སོང་སྟེ་ཆོས་བསྟན་ནས།
en: Recognizing this he went to his parents and gave them a Dharma teaching,

source: སྡིག་པའི་ལས་དེ་ལས་བཟློག་སྟེ།
en: turning them away from nonvirtuous actions,

source: བདེན་པ་རྣམས་དང་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གནས་རྣམས་ལ་ཡང་བཀོད་དོ། །
en: establishing them in the truths, and leading them to go for refuge and maintain the fundamental precepts.

source: སྦྱིན་པ་དང་སྦྱིན་པའི་བགོ་བཤའ་བྱ་བ་ལ་ཡང་བཙུད་དེ་དེས་ཁྱིམ་དེ་སློང་བའི་སྐྱེ་བོ་རྣམས་ཀྱི་ཆུ་དོང་ལྟ་བུར་གྱུར་པར་བྱས་སོ། །
en: He inspired them to give gifts and to share what they had, until their home became like an open well for those in need.

source: དགེ་སློང་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་པ་དེ་ལ་ཡང་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་སྦྱར་ཏོ། །
en: They supplied their arhat monk son with many good, wholesome foods,

source: དེས་ཀྱང་བདག་ཉིད་ཀྱང་ལོངས་སྤྱོད་པར་བྱེད་ལ་ཚངས་པར་སྤྱོད་པ་གཞན་དག་ལ་ཡང་སྦྱིན་པར་བྱེད་དོ། །
en: and he partook of them himself and shared them with other practitioners of the holy life.

source: བཙུན་པ་དགེ་སློང་འདིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་ཤན་པའི་རིགས་སུ་ཡང་སྐྱེས་ལ།
en: “Lord, what action did this monk take that ripened into his birth into a butcher’s family, one of great means, prosperity, and wealth;

source: སྡིག་པའི་ལས་ལ་ཡང་སེམས་མ་ཞུགས།
en: that he did not think to commit nonvirtuous actions;

source: བཅོམ་ལྡན་འདས་ཀྱང་འདིས་མཉེས་པར་བགྱིས་ཏེ། མི་མཉེས་པར་མ་བགྱིས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་ཡང་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ཁྱིམ་པའི་ཚེ་དང་རབ་ཏུ་བྱུང་བའི་ཚེ་ན་ཡང་བཟའ་བ་དང་བཅའ་བ་བཟང་པོ་དང་ལྡན་པར་གྱུར་ལགས།
en: that he pleased the Blessed One, did not displease him, went forth in the doctrine of the Buddha, cast away all afflictive emotions, and manifested arhatship; that after having been a householder, he went forth; and that he received such good, wholesome foods?”

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། རི་ཁྲོད་ཅིག་ན་ཤན་པ་མང་པོ་དག་ཅིག །
en: “Monks, in times past, a certain group of butchers was living on a mountainside.

source: སྐྱེད་མོས་ཚལ་གྱི་ནང་དུ་དོང་སྟེ་བཟའ་བ་དང་བཅའ་བ་བཟང་པོ་མང་པོ་བཤམས་པ་ལས། རང་སངས་རྒྱས་ཞིག་སྐྱེད་མོས་ཚལ་དེར་བསོད་སྙོམས་ལ་འོངས་ནས། དེ་ཤན་པའི་མི་ཞིག་གིས་མཐོང་སྟེ།
en: They had gone into a grove and set forth many good, wholesome foods when a solitary buddha came into the grove seeking alms, and one of the butchers happened upon him.

source: མཐོང་མ་ཐག་ཏུ་ཤན་པའི་མི་དེ་རང་སངས་རྒྱས་དེ་ལ་ཤིན་ཏུ་དགའ་བ་སྐྱེས་ཏེ། དགའ་བ་སྐྱེས་ནས་རང་སངས་རྒྱས་དེ་ལ་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་ཕུལ་ལོ། །
en: The butcher was delighted to have found the solitary buddha, and cordially offered good, wholesome foods to him.

source: བདག་ཉིད་ཆེན་པོ་དེ་དག་ནི་ལུས་ཀྱིས་ཆོས་སྟོན་པར་བྱེད་ཀྱི་ཚིག་གིས་ཆོས་སྟོན་པར་མི་བྱེད་དེ། དེས་དེར་བསོད་སྙོམས་བླངས་ནས། དེ་ཉིད་དུ་སྟེང་གི་ནམ་མཁའ་ལ་སོང་ངོ་། །
en: Great persons teach the Dharma not with their words but through their actions, so the solitary buddha accepted the alms and then rose into the sky.

source: དེ་ནས་མི་དེས་མཐོང་ནས་ལྷག་པར་ཡང་དགའ་བ་སྐྱེས་སོ། །
en: This delighted the butcher, and,

source: དེ་དགའ་བ་སྐྱེས་ནས་སྨོན་ལམ་བཏབ་པ།
en: full of joy, he prayed,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་བདག་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་ཤན་པའི་རིགས་སུ་སྐྱེས་ལ།
en: ‘By this root of virtue, wherever I am born, may it be into a butcher’s family, one of great means, prosperity, and wealth,

source: བཟའ་བ་དང་བཅའ་བ་བཟང་པོ་དང་ཡང་ལྡན་པ་དང་བདག་སྡིག་པའི་ལས་དེ་ཡང་མི་བྱེད་པ་དང་།
en: where I may enjoy many good, wholesome foods. May I also not perform nonvirtuous actions.

source: འདི་བས་ཀྱང་ཆེས་ཁྱད་པར་དུ་འཕགས་པའི་སྟོན་པ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག་མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: May I please and not displease a teacher even more exalted than this.

source: ཡོན་ཏན་གྱི་ཚོགས་འདི་ལྟ་བུ་དག་ཀྱང་ཐོབ་པར་གྱུར་ཅིག །
en: May I achieve such great virtues.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས།
en: Going forth in his doctrine alone,

source: ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: may I cast away all afflictive emotions, and manifest arhatship.’

source: དེའི་ཚེ་ཤན་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་འདི་ཉིད་ཡིན་ཏེ།
en: The one who was that butcher then is none other than this monk.

source: དེས་རང་སངས་རྒྱས་དེ་ལ་བཤོས་ཕུལ་ནས། སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་ཤན་པའི་རིགས་སུ་སྐྱེས་ནས་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་གྱུར་ཏེབཟའ་བ་དང་བཅའ་བ་བཟང་པོ་དང་ཡང་ལྡན་པར་གྱུར་ལ། དེས་སྡིག་པའི་ལས་ཀྱང་མ་བྱས་ཏེ།
en: The actions of offering food to the solitary buddha and saying that prayer ripened such that wherever he was born, it was into a family of great means, prosperity, and wealth where he could enjoy many good, wholesome foods, and where he was well proportioned, pleasing to the eye, and beautiful, and where he did not perform any nonvirtuous actions.

source: དགེ་སློང་དག་ང་རང་སངས་རྒྱས་བྱེ་བ་ཕྲག་འབུམ་བས་ཀྱང་ཆེས་ལྷག་པར་ཁྱད་པར་དུ་འཕགས་པ། ང་ལྟ་བུ་འདིས་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ལ།
en: Monks, I am more exalted than even one hundred billion solitary buddhas, and now he has pleased me and not displeased me,

source: ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.

source: གཞན་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་འདི་རབ་ཏུ་བྱུང་ནས་དེར་འདིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: “Furthermore, he had gone forth in the doctrine of the totally and completely awakened Buddha Kāśyapa, and after practicing pure conduct all his life, at the time of his death, he prayed,

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: Going forth in his doctrine alone may I cast away all afflictive emotions, and manifest arhatship.’

source: དགེ་སློང་དག་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་བའི་དགེ་སློང་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི། དགེ་སློང་འདི་ཉིད་ཡིན་ཏེ
en: “Monks, the monk who went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa then is none other than this monk.

source: དེས་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས། འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: Back then, he practiced pure conduct all his life, and at the time of his death, he prayed,

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་པ་དེས་ན།
en: Going forth in his doctrine alone may I cast away all afflictive emotions, and manifest arhatship.’

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་ཤིན་ཏུ་མཉམ་པ་དང་ཤུགས་མཉམ་པ་དང་མཛད་པ་མཉམ་པ་དང་ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས་
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—

source: འདིས་ང་མཉེས་པར་བྱས་ཏེམི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།། །།
en: that he has pleased me and not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.”

source: གསེར་མདོག་ཅེས་བྱ་བ་ནི།
en: The Story of Golden Color

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན། རིགས་ངན་ཞིག་གནས་པ་དེས་ཐབས་ཟླར་བབ་པ་ལ་ཆུང་མ་བླངས་པ་ལས་ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས་
en: When the Blessed One was in Śrāvastī, there lived a certain man who belonged to a lower caste. When the time came for him to marry he took a wife.

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་མོ་མི་སྡུག་པ་མཆོག་ཏུ་མི་སྡུག་ལ་མི་སྡུག་པའི་སྣ་གྲངས་བཅྭ་བརྒྱད་དང་ལྡན་པ་ཞིག་བཙས་ནས་
en: One day his wife conceived, and after nine or ten months had passed, she gave birth to an exceptionally ugly baby who was ugly in eighteen different ways.

source: དེ་མཐོང་མ་ཐག་ཏུ་ཕ་མ་གཉིས་ཤིན་ཏུ་མི་དགའ་བར་གྱུར་ཏེ
en: As soon as they saw her, her parents were crestfallen.

source: བདག་ཅག་གཉིས་ལ་བུ་མོ་འདི་འདྲ་བ་མི་དགོས་ཀྱིས་ནམ་སྲོས་པ་དང་ཕྱིར་ཕྱུང་ལ་ཁྱི་རྣམས་ལ་སྦྱིན་ནོ་ཞེས་ཟེར་རོ། །
en: “A daughter like this is no use to us,” her father said. “When night falls, we’ll toss her out to the dogs!”

source: དེ་ནས་ཆུང་མ་ན་རེ་ཇོ་བོ་དེ་སྐད་མ་གསུང་ཞིག །
en: “My lord, don’t say such things!

source: འཇིག་རྟེན་ན་མི་གསོད་པ་ནི་རྣམ་པར་སྨད་པ་ལགས་ཀྱིས།
en: Murder is disgraceful.

source: འདི་འདི་ཁོ་ན་ལྟར་མི་སྡུག་པའི་རྣམ་གྲངས་བཅྭ་བརྒྱད་དང་ལྡན་དུ་ལགས་ཀྱིས་ཀྱང་།
en: Not only that but this child is our daughter.

source: འདི་བདག་ཅག་གཉིས་ཀྱི་བུ་མོ་ལགས་པས་ན། འདི་བཙས་མ་ཐག་ཏུ་བདག་ཅག་གིས་དོར་མི་ནུས་ཀྱིས་ནམ་ཆེར་སྐྱེས་པ་ན་བསྐྲད་པར་བགྱིའོ། །
en: We can’t just abandon her as soon as she’s born, even if she is ugly in eighteen different ways. Wait until she’s grown—then we’ll throw her out.

source: འོན་ཀྱང་འདི་དེའི་ཚེ་ཅིས་ཀྱང་འཚོ་བ་ཚོལ་ནུས་པར་འགྱུར་རོ་ཞེས་བྱས་སོ། །
en: By that time she’ll be able to make a living for herself somehow.”

source: དེ་ནས་འོ་ན་དེ་ལྟར་བྱའོ་ཞེས་སྨྲས་ནས།
en: “Very well, that is what we’ll do.”

source: དེ་ཕ་མ་གཉིས་ཀྱིས་ལྐོག་ཏུ་གསོས་ཏེ། ཅི་ནས་སུས་ཀྱང་མི་ཤེས་པར་བྱས་སོ། །
en: Her parents raised her in secret and no one knew about her.

source: དེ་ནས་དེ་གང་གི་ཚེ་འགྲོ་ནུས་པར་གྱུར་པ་དེའི་ཚེ་དེ་མི་སྡུག་ཆེས་ནས། ཕ་མ་གཉིས་ཀྱིས་ཁྱིམ་ནས་བསྐྲད་དེ་བཏང་ངོ་། །
en: When she was old enough to walk, she was still so ugly that her parents threw her out of the house and abandoned her.

source: དེ་ནས་དེ་སློངས་མོ་བྱེད་ཅིང་སྲང་དེ་ཡན་མན་ན་གནས་པ་ལས།
en: After that she begged for alms and lived where she could on the streets.

source: དེས་ས་སྒྲེན་པོ་ལ་གནས་པ་དང་ཁ་ཟས་ངན་པ་ཟ་ཟ་བས་ལུས་ལ་མཛེ་ནད་དང་རྨ་བྱུང་བར་གྱུར་ཏེདེ་ཕྱི་ཞིག་ན་ནད་བུ་ཅན་དུ་གྱུར་ནས།
en: She lived on the bare ground and ate wretched food, and as a result she became leprous and covered in sores.

source: སྲང་དེ་ན་འགྱེལ་ཞིང་འདུག་སྟེ། ཤི་ལ་ཐུག་པ་དང་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་མཐོང་སྟེ།
en: In time she became very sick, and collapsed in the street, near death. It was then that Venerable Ānanda saw her.

source: མཐོང་མ་ཐག་ཏུ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྙིང་རྗེ་སྐྱེས་ནས་དེ་དེའི་ཐད་དུ་སོང་སྟེ་སྨྲས་པ། ཆེ་གེ་ཅི་ཉེས་དེས་སྨྲས་པ།
en: As soon as he saw her, Venerable Ānanda was filled with compassion for her, and he went to her and asked, “Sister, what happened?”

source: བཙུན་པ་ཀུན་དགའ་བོ་བདག་གིས་སྔོན་བསོད་ནམས་དག་མ་བགྱིས་པས་ན།
en: “Lord Ānanda, I have failed to collect any merit.

source: དེས་བདག་འདི་ཁོ་ན་ལྟ་བུར་གྱུར་པ་ལགས་ཀྱིས།
en: That’s how I came to be like this.

source: བཙུན་པ་ཀུན་དགའ་བོ་ཅི་ནས་བདག་གི་མི་དགེ་བའི་ལས་འདི་ཡོངས་སུ་ཟད་པར་འགྱུར་བར་མཛད་དུ་གསོལ།
en: Lord Ānanda,” she pleaded, “please help me put an end to all this nonvirtue, come what may.”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་སྨྲས་པ། ཆེ་གེ་སྙིང་མ་ཆུང་བར་སྤྲོ་བ་སྐྱེད་ཅིག་དང་།
en: “Don’t worry, sister,” Venerable Ānanda replied. “Take heart.

source: བདག་གིས་ཁྱོད་ཀྱི་མི་དགེ་བའི་ལས་འདི་བསལ་བར་བྱའོ། །
en: I shall dispel your nonvirtuous actions.”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་དེའི་དོན་དུ་ཏིལ་མར་དང་སྤོས་བཙལ་ནས་བུ་མོ་དེ་ག་ལ་བར་སོང་སྟེ་
en: With this, Venerable Ānanda went to find sesame oil and incense for her.

source: ཕྱིན་ནས་
en: He returned and said to her, “Rise, sister.

source: སྨྲས་པ། ཆེ་གེ་ལོངས་ལ་བཅོམ་ལྡན་འདས་ཀྱི་དབུ་སྐྲ་དང་སེན་མོའི་མཆོད་རྟེན་ལ་སྤོས་ཀྱིས་བྱུགས་ཤིག །
en: Go and offer this incense to the stūpas containing the hair and nail relics of the Blessed One.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་བུ་མོ་དེ་དགའ་བ་སྐྱེས་ནས་ལངས་ཏེ་
en: As she heard this, the young woman was filled with joy, and she rose and followed Venerable Ānanda.

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོའི་ཕྱི་བཞིན་སོང་ནསཀུན་དགའ་བོས། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་ཏིལ་མར་གྱི་བྱུག་པ་དང་། སྦྱར་བའི་སྤོས་ཀྱི་བྱུག་པ་དང་། གུར་གུམ་གྱི་བྱུག་པ་འབུལ་དུ་བཅུག་གོ། །
en: Then Ānanda led her to make offerings of sesame oil ointment, blended incense ointment, and saffron ointment to the Tathāgata’s stūpa.

source: ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་ཡང་ས་ཕྱོགས་དེར་འོངས་ཏེ། དེས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་མཐོང་ནས་བཙུན་པ་ཀུན་དགའ་བོ་ཅི་མཛད་ཅེས་དྲིས་སོ། །
en: The householder Anāthapiṇḍada had also come to the region, and when he saw Venerable Ānanda, he asked him, “Lord Ānanda, what are you doing here?”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་སྨྲས་པ། བུ་མོ་འདིའི་དབུལ་བ་ཡོངས་སུ་གཅད་པར་བྱའོ། །
en: “I am putting an end to this young woman’s poverty,” said Venerable Ānanda.

source: དེ་ནས་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱིས་ཀྱང་བུ་མོ་དེ་སྒྲེན་མོར་འདུག་པ་མཐོང་ནས་གོས་བྱིན་ནོ། །
en: Anāthapiṇḍada saw her sitting there naked and gave her clothing.

source: བཅོམ་ལྡན་འདས་ཀྱང་བུ་མོ་དེ་ཁོ་ན་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་ས་ཕྱོགས་དེར་གཤེགས་ནས་
en: The Blessed One also came to the region purely out of compassion for that young woman.

source: བུ་མོ་དེས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཛེས་ཤིང་ཡིད་དུ་འཐད་ལ། དབང་པོ་ཞི་བ། ཐུགས་ཞི་བ། ཐུགས་མཆོག་ཏུ་དུལ་བ་དང་རྣམ་པར་ཞི་བ་དང་ལྡན་པ་གསེར་གྱི་མཆོད་སྡོང་ལྟར་དཔལ་འབར་བ་མཐོང་ངོ་། །
en: She saw the Blessed One in the distance and he was beautiful and handsome, his senses were at peace, his heart was at peace, and his mind was perfectly tame. He was graced with tranquility, shining and brilliant like a golden pillar.

source: མཐོང་ནས་ཀྱང་བུ་མོ་དེ་ཡང་མཆོག་ཏུ་དགའ་བ་སྐྱེས་སོ། །དགའ་བ་སྐྱེས་ནས་བསམས་པ།
en: Upon seeing him, the young woman was overcome with joy and thought,

source: འདིའི་དབུ་སྐྲ་དང་སེན་མོའི་མཆོད་རྟེན་དག་ལ་བཀུར་སྟི་བྱས་ན་ཡང་འབྲས་བུ་ཆེན་པོར་འགྱུར་ན། འདི་ཉིད་ལ་བྱས་པ་ལྟ་ཅི་སྨོས་ཏེ། འབྲས་བུ་ཆེན་པོར་ཇི་སྟེ་མི་འགྱུར་སྙམ་ནས།
en: “If one can attain great results from just venerating a stūpa with his hair and nails, then surely I can attain an even greater result if I worship him in person!”

source: དགའ་བ་སྐྱེས་ཏེ། གོས་དེ་ཁྱེར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ལ་གོས་དེ་ཕུལ་ཏེ། ཐལ་མོ་སྦྱར་ནས། བཅོམ་ལྡན་འདས་ལ་རྟོག་ཅིང་འདུག་གོ། །
en: Filled with joy, she took the clothes Anāthapiṇḍada had given her, approached the Blessed One, offered him the clothing, folded her hands, and sat there studying him.

source: དེ་ནས་དེ་བཅོམ་ལྡན་འདས་ལ་སེམས་དགའ་བར་གྱུར་བཞིན་དུ་ཤི་འཕོས་ཏེ་དུས་ལས་འདས་ནས་མཉན་དུ་ཡོད་པ་དེ་ཉིད་དུ་ཚོང་དཔོན་ཞིག་གི་ཁྱིམ་དུ་ཆུང་མ་ཆེན་མའི་ལྟོར་ཉིང་མཚམས་སྦྱར་ནས
en: She died shortly thereafter with joy toward the Blessed One in her heart, transmigrated, and took rebirth in the womb of the foremost wife of a merchant householder there in Śrāvastī.

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་མོ་གསེར་གྱི་མདོག་ཅན་ཞིག་བཙས་ཏེ།
en: After nine or ten months had passed, the wife gave birth to a child with a golden complexion.

source: བུ་མོ་འདིའི་མིང་ཇི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ།
en: “What name should we give this child?”

source: བུ་མོ་འདི་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་ཏེ། གསེར་གྱི་མདོག་ཅན་ཡིན་པས་ན། དེའི་ཕྱིར་བུ་མོ་འདིའི་མིང་གསེར་གྱི་མདོག་ཅེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: And they named her, saying, “Since this child is well proportioned, pleasing to the eye, beautiful, and has a golden complexion, her name will be Golden Color.”

source: དེ་ནས་བུ་མོ་གསེར་གྱི་མདོག་ཅན་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ།
en: They reared young Golden Color on milk, yogurt, butter, ghee, and milk solids.
